<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="melspectogram" type="Parameter" version="opset1">
			<data shape="1,128,1501" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="melspectogram">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1501</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="melspectogram_length" type="Parameter" version="opset1">
			<data shape="1" element_type="i32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="melspectogram_length">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/encoder/pre_encode/conv/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_23358_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_23358" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Multiply_22544" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_23359_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_23359" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/encoder/pre_encode/conv/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Div_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/encoder/pre_encode/conv/Cast_3" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/encoder/pre_encode/conv/Cast_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_23360_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_23360" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/encoder/pre_encode/conv/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Add_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_23361_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_23361" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_22554" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_23362_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_23362" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/encoder/pre_encode/conv/Div_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Div_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/encoder/pre_encode/conv/Cast_7" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/encoder/pre_encode/conv/Cast_8" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_23363_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_23363" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/encoder/pre_encode/conv/Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Add_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_23364_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_23364" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Multiply_22564" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_23365_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_23365" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/encoder/pre_encode/conv/Div_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Div_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/encoder/pre_encode/conv/Cast_11" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/encoder/pre_encode/conv/Cast_12" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_23366_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_23366" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/encoder/pre_encode/conv/Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Add_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="encoder_output_length" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="encoder_output_length">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_23367_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="6" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_23367" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_615" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2054" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/encoder/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1501</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/Transpose_output_0">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/encoder/pre_encode/conv/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/encoder/pre_encode/conv/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/encoder/pre_encode/conv/Expand" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1501" offset="2086" size="12008" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Expand_output_0">
					<dim>1</dim>
					<dim>1501</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/encoder/pre_encode/conv/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/encoder/pre_encode/conv/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/encoder/pre_encode/conv/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/pre_encode/conv/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/encoder/pre_encode/conv/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1501</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Less_output_0">
					<dim>1</dim>
					<dim>1501</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/encoder/pre_encode/conv/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14094" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/encoder/pre_encode/conv/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1501</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Unsqueeze_2_output_0">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/encoder/pre_encode/conv/Where_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="14102" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/encoder/pre_encode/conv/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Expand_1_output_0">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/encoder/pre_encode/conv/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_2_output_0">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/encoder/pre_encode/conv/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/encoder/pre_encode/conv/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Unsqueeze_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Multiply_19005" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="ShapeOf_19006" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/encoder/pre_encode/conv/Where_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="14126" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Maximum_19007" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/encoder/pre_encode/conv/Mul_3" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="encoder.pre_encode.conv.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 1, 3, 3" offset="14158" size="4608" />
			<output>
				<port id="0" precision="FP16" names="encoder.pre_encode.conv.0.weight">
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="encoder.pre_encode.conv.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/encoder/pre_encode/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1501</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_687_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="18766" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_687" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/encoder/pre_encode/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/encoder/pre_encode/conv/Expand_3" type="Const" version="opset1">
			<data element_type="i64" shape="1, 751" offset="19278" size="6008" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Expand_3_output_0">
					<dim>1</dim>
					<dim>751</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/encoder/pre_encode/conv/Cast_5" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/encoder/pre_encode/conv/Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_23_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/encoder/pre_encode/conv/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/pre_encode/conv/Unsqueeze_4_output_0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/encoder/pre_encode/conv/Less_1" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>751</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Less_1_output_0">
					<dim>1</dim>
					<dim>751</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/encoder/pre_encode/conv/Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14094" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_24_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/encoder/pre_encode/conv/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>751</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Unsqueeze_5_output_0">
					<dim>1</dim>
					<dim>751</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/encoder/pre_encode/conv/Where_4" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="25286" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/encoder/pre_encode/conv/Expand_4" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>751</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Expand_4_output_0">
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/encoder/pre_encode/conv/Cast_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_6_output_0">
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/encoder/pre_encode/conv/Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_28_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/encoder/pre_encode/conv/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Unsqueeze_6_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/encoder/pre_encode/conv/Where_5" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="25310" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_5_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/encoder/pre_encode/conv/Expand_5" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Expand_5_output_0,/encoder/pre_encode/conv/Expand_6_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/encoder/pre_encode/conv/Mul_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_7_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/encoder/pre_encode/conv/conv.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/conv.1/Relu_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/encoder/pre_encode/conv/Mul_9" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_9_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_781_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 1, 1, 3, 3" offset="25342" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_781" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/encoder/pre_encode/conv/conv.2/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>751</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_831_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="29950" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_831" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/encoder/pre_encode/conv/conv.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/conv.2/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/encoder/pre_encode/conv/Expand_7" type="Const" version="opset1">
			<data element_type="i64" shape="1, 376" offset="30462" size="3008" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Expand_7_output_0">
					<dim>1</dim>
					<dim>376</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/encoder/pre_encode/conv/Cast_9" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/pre_encode/conv/Cast_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/encoder/pre_encode/conv/Constant_44" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_44_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/encoder/pre_encode/conv/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/pre_encode/conv/Unsqueeze_7_output_0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/encoder/pre_encode/conv/Less_2" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>376</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Less_2_output_0">
					<dim>1</dim>
					<dim>376</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/encoder/pre_encode/conv/Constant_45" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14094" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_45_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/encoder/pre_encode/conv/Unsqueeze_8" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>376</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Unsqueeze_8_output_0">
					<dim>1</dim>
					<dim>376</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/encoder/pre_encode/conv/Where_8" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="33470" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_8_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/encoder/pre_encode/conv/Expand_8" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>376</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/pre_encode/conv/Expand_8_output_0">
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/encoder/pre_encode/conv/Cast_10" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/Cast_10_output_0">
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/encoder/pre_encode/conv/Constant_49" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Constant_49_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/encoder/pre_encode/conv/Unsqueeze_9" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Unsqueeze_9_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/encoder/pre_encode/conv/Where_9" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="33494" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/pre_encode/conv/Where_9_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/encoder/pre_encode/conv/Expand_9" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Expand_10_output_0,/encoder/pre_encode/conv/Expand_11_output_0,/encoder/pre_encode/conv/Expand_9_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/encoder/pre_encode/conv/Mul_13" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_13_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="encoder.pre_encode.conv.3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 1, 1" offset="33526" size="131072" />
			<output>
				<port id="0" precision="FP16" names="encoder.pre_encode.conv.3.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="encoder.pre_encode.conv.3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/encoder/pre_encode/conv/conv.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_912_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="164598" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_912" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/encoder/pre_encode/conv/conv.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/conv.3/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/encoder/pre_encode/conv/Mul_15" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_15_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/encoder/pre_encode/conv/conv.1_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/pre_encode/conv/conv.1_1/Relu_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/encoder/pre_encode/conv/Mul_17" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/pre_encode/conv/Mul_17_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Reshape_954_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 1, 1, 3, 3" offset="165110" size="4608" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Reshape_954" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/encoder/pre_encode/conv/conv.5/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>376</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>188</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Reshape_1004_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="169718" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape_1004" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
