<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="encoder_outputs" type="Parameter" version="opset1">
			<data shape="1,1,1024" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_outputs">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="decoder_outputs" type="Parameter" version="opset1">
			<data shape="1,1,640" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="decoder_outputs">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_33450_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 8198" offset="0" size="16396" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_33450" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_33448_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 640" offset="16396" size="1280" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_33448" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_33330_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="640, 1024" offset="17676" size="1310720" />
			<output>
				<port id="0" precision="FP16">
					<dim>640</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_33330" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>640</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>640</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/enc/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>640</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/enc/MatMul_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/enc/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/enc/Add_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1328396" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_33449_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 640" offset="1328404" size="1280" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_33449" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_33337_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="640, 640" offset="1329684" size="819200" />
			<output>
				<port id="0" precision="FP16">
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_33337" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/pred/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/pred/MatMul_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/pred/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/pred/Add_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2148884" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/joint_net/joint_net.0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/joint_net/joint_net.0/Relu_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_33346_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8198, 640" offset="2148892" size="10493440" />
			<output>
				<port id="0" precision="FP16">
					<dim>8198</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Transpose_33346" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8198</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8198</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/joint_net/joint_net.2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8198</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/joint_net/joint_net.2/MatMul_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/joint_net/joint_net.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/joint_net/joint_net.2/Add_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="logits" type="LogSoftmax" version="opset5">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="logits">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="logits/sink_port_0" type="Result" version="opset1" output_names="logits">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8198</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.3.0-19807-44526285f24-releases/2025/3" />
		<conversion_parameters>
			<input_model value="DIR\parakeet_joint.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
